       >> SOURCE FORMAT IS FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut2.
AUTHOR thomas.
DATE-WRITTEN. June 6th 2022
ENVIRONMENT DIVISION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 UserName PIC X(30) VALUE "You".
01 NUm1 PIC 9 VALUE ZEROS.
01 NUm2 PIC 9 VALUE ZEROS.
01 Total PIC 99 VALUE 0.
01 SSNum.
    02 SSArea   PIC 999.
    02 SSGroup  PIC 99.
    02 SSSerial PIC 9999.
01 PIValue CONSTANT AS 3.14.
*> ZERO, ZEROES
*> SPACE SPACES
*> HIGH-VALUES
*> LOW-VALUES
PROCEDURE DIVISION.
DISPLAY "what is your surname " WITH NO ADVANCING
ACCEPT UserName
DISPLAY "Hello " UserName


STOP RUN.