000100 
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. coboltut.
000400 AUTHOR. Thomas Andrikus.
000500 DATE-WRITTEN. June 6th 2022
000600 ENVIRONMENT DIVISION.
000700 
000800 DATA DIVISION.
000900 FILE SECTION.
001000 WORKING-STORAGE SECTION.
001100 01 UserName PIC X(30) VALUE "You".
001200 01 NUm1 PIC 9 VALUE ZEROS.
001300 01 NUm2 PIC 9 VALUE ZEROS.
001400 01 Total PIC 99 VALUE 0.
001500 01 SSNum.
001600     02 SSArea   PIC 999.
001700     02 SSGroup  PIC 99.
001800     02 SSSerial PIC 9999.
001900 01 PIValue CONSTANT AS 3.14.
002000 *> ZERO, ZEROES
002100 *> SPACE SPACES
002200 *> HIGH-VALUES
002300 *> LOW-VALUES
002400 PROCEDURE DIVISION.
002500 DISPLAY "what is your name " WITH NO ADVANCING
002600 ACCEPT UserName
002700 DISPLAY "Hello " UserName
002800 
002900 
003000 
003100 STOP RUN.
